mschorer/chirp_esp32_node_proto_epaper/chirp_esp32_node_proto_epaper.ino
/**
 * 
 * FOR THIS EXAMPLE TO WORK, YOU MUST INSTALL THE "LoRaWAN_ESP32" LIBRARY USING
 * THE LIBRARY MANAGER IN THE ARDUINO IDE.
 * 
 * This code will send a two-byte LoRaWAN message every 15 minutes. The first
 * byte is a simple 8-bit counter, the second is the ESP32 chip temperature
 * directly after waking up from its 15 minute sleep in degrees celsius + 100.
 *
 * If your NVS partition does not have stored TTN / LoRaWAN provisioning
 * information in it yet, you will be prompted for them on the serial port and
 * they will be stored for subsequent use.
 *
 * See https://github.com/ropg/LoRaWAN_ESP32
*/

#include <OneWire.h>
#include <DallasTemperature.h>

#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>

#include <RadioLib.h>
#include <LoRaWAN_ESP32.h>

#include <SensorData.h>

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  #include "driver/temperature_sensor.h"
#else
  #include "driver/temp_sensor.h"
#endif

#define LL_OFF  0
#define LL_LOW  1
#define LL_MED  2
#define LL_HGH  2

#define LOGLEVEL  LL_LOW

//#define LOGLEVEL  LL_LOW

#define RADIOLIB_DEBUG_PROTOCOL 1
#define HELTEC_V3FIX
//#define ADC_SCALE 0.00403532794741887
//#define ADC_SCALE ( 1/238.7)
//#define ADC_SCALE 0.00433
#define ADC_SCALE 0.00175

#define LED_OFF 0
#define LED_LOW 3
#define LED_MID 15
#define LED_BRIGHT  50

#define FALSE 0
#define TRUE 1

#define XSHUT_PIN 47

#define VBAT_CTRL GPIO_NUM_19
#define VBAT_ADC  GPIO_NUM_20

//#include <heltec_unofficial.h>
#include <heltec-eink-modules.h>

//-------------------------------------------------------

#include <stdarg.h>
#include <stdio.h>

//---- LoRaWan ----

uint8_t fPort = 1;

LoRaWANNode* node = 0;
SX1262 radio = new Module(PIN_LORA_NSS, PIN_LORA_DIO_1, PIN_LORA_NRST, PIN_LORA_BUSY);
LCMEN2R13EFC1 display;    // V1.0
// QYEG0213RWS800 display;

// Pause between sends in seconds, so this is every 15 minutes. (Delay will be
// longer if regulatory or TTN Fair Use Policy requires it.)
#define MINIMUM_DELAY 300

#define RELAX_DELAY 120
#define RELAX_FB    3

#define ALERT_DELAY 60
#define ALERT_FB    3

#define EMERG_DELAY 30
#define EMERG_FB    10

#define AUTO_FALLBACK 16

#define LORA_DUTY_CYCLE 0     // for legal limit: 0, forTTN: 1250

// Pause between sends in seconds, so this is every 5 minutes. (Delay will be
// longer if regulatory or TTN Fair Use Policy requires it.)
#define MINIMUM_DELAY 300

// you can also retrieve additional information about an uplink or 
// downlink by passing a reference to LoRaWANEvent_t structure
LoRaWANEvent_t uplinkDetails;
LoRaWANEvent_t downlinkDetails;

//RTC_DATA_ATTR uint8_t count = 0;

//----------------------------------------------

//#include "Fonts/FreeMonoBold12pt7b.h"
#include "Fonts/FreeMono9pt7b.h"
#include "Fonts/FreeMonoBold9pt7b.h"
//#include "Fonts/FreeSansBold9pt7b.h"

// These are just for the sketch's reference - the library does not require them
const Color DEFAULT_TEXT_COLOR = BLACK;
const GFXfont *DEFAULT_FONT = &FreeMono9pt7b;
const GFXfont *DEFAULT_BOLD = &FreeMonoBold9pt7b;
//const GFXfont *DEFAULT_BOLD = &FreeSansBold9pt7b;
const int textbox_padding = 5;                  // How much padding inside textBox() - used by installGuide()
FullBounds f = display.bounds.full;             // Quick access to dimensions of full-screen

//-------------------------------------------------------

#define DOWN_SIZE 220

SensorData up( 128);
SensorData down( DOWN_SIZE);

LoraNode *localNode;

//---- RTC persistent storage ----

#define HIST_DEPTH 120

struct climHist {
  LoraBME280 bme[ HIST_DEPTH];
  int8_t current;
  int8_t last;
};

struct tofNode {
  LoraNode node;
  LoraToF tof;
  LoraFill fill;
  LoraBME280 bme;
  climHist hist;
};

#define REMOTE_NODES  4
#define REMOTE_NODE_MASK  0x03

#define NODE_WELL 0
#define NODE_CAMP 1
#define NODE_FNTE 2
#define NODE_RUIN 3

const char* node_names[ REMOTE_NODES] = { "well", "camp", "fnte", "ruin"};

struct dataMem {
  tofNode remotes[ REMOTE_NODES];
  uint16_t loraDelay;
  uint16_t loraDlyFb;
};

#define RTC_BLOCK_OFFSET 64
struct rtcMem {
  struct dataMem data;
  long crc32;
};

RTC_DATA_ATTR rtcMem cache;

void restoreData( rtcMem *pData) {
  uint32_t crcNow = calculateCRC32( (uint8_t *)&pData->data, sizeof(pData->data));

    Serial.printf( "restore [%x] [%x]\n", crcNow, pData->crc32);

   if ( pData->crc32 != crcNow) {
    initData( &pData->data);
   }
}

void persistData( rtcMem *pData) {
  pData->crc32 = calculateCRC32( (uint8_t *)&pData->data, sizeof(pData->data));
  Serial.printf( "backup [%x]\n", pData->crc32);
}

void initData( dataMem* data) {
  uint8_t i;

  for( i=0; i < REMOTE_NODES; i++) {
    data->remotes[ i].tof.dist = -1;
    data->remotes[ i].fill.percent = 0;
    data->remotes[ i].bme.temp = 250;
    data->remotes[ i].bme.hmd = 500;
    data->remotes[ i].bme.prs = 9500;
    /*
    for ( uint8_t j=0; i < HIST_DEPTH; j++) {
      data->remotes[ i].hist.bme[j].temp = 250;
      data->remotes[ i].hist.bme[j].hmd = 500;
      data->remotes[ i].hist.bme[j].prs = 9500;
    }
    */
    data->remotes[ i].hist.current = -1;
    data->remotes[ i].hist.last = 0;
  }

  data->loraDelay = MINIMUM_DELAY;
  data->loraDlyFb = 0;
}

//-------------------------------------------------------

//---- display code ----

void sprintAt( int16_t x, int16_t y, const char *fmt, ...) {
  char gstring[48];
  va_list args;

  va_start(args, fmt);

  vsprintf( gstring, fmt, args);

  display.setCursor( x, y);   // Text cursor
  display.print( gstring);
}

void drawVBar( uint8_t x,  uint8_t y, uint8_t w, uint8_t h, int8_t headroom) {
  if ( headroom >= 0) {
    display.drawRect( x, y, w, headroom, DEFAULT_TEXT_COLOR);
    display.fillRect( x, y+headroom, w, h-headroom, DEFAULT_TEXT_COLOR);
  } else {
    display.drawRect( x, y, w, h, DEFAULT_TEXT_COLOR);
    display.drawLine( x, y, x+w-1, y+h-1, DEFAULT_TEXT_COLOR);
  }
}

void drawHBar( uint8_t x,  uint8_t y, uint8_t w, uint8_t h, int8_t fill) {
  display.fillRect( x, y, fill, h, DEFAULT_TEXT_COLOR);
  display.drawRect( x+fill, y, w-fill, h, DEFAULT_TEXT_COLOR);
}

