mschorer/chirp_esp32_node_proto_epaper/chirp_esp32_node_proto_epaper.ino
void drawContainer( uint8_t x, uint8_t y, uint8_t w, uint8_t h, uint8_t nodedIdx) {
  int8_t headroom = -1;

  if ( cache.data.remotes[ nodedIdx].fill.percent > 0) {
    headroom = h - min( (int8_t) h, int8_t ((h * cache.data.remotes[ nodedIdx].fill.percent) / 10000));
  }
  drawVBar( x, y, w, h, headroom);

  sprintAt( x, y+2, "% 4i", cache.data.remotes[ nodedIdx].tof.dist);
  display.setTextColor( WHITE);
  sprintAt( x, y+h-10, "% 4i", cache.data.remotes[ nodedIdx].tof.dist);
  display.setTextColor( DEFAULT_TEXT_COLOR);
}

void drawFill( uint8_t y) {
  uint8_t i = 0, x = 0;

  drawContainer( x, y, 40, 100, i++);
  x += 42;
  drawContainer( x, y, 38, 46, i++);
  y += 54;
  drawContainer( x, y, 38, 46, i++);
  x += 40;
  drawContainer( x, y, 38, 46, i++);

  /*
  for( i=1; i < REMOTE_NODES; i++) {
    drawContainer( x, y, 24, 80, &cache.data.remotes[ i].fill);
    x += 26;
  }
  */
}

void drawBME( uint8_t x, uint8_t y, uint8_t nodedIdx) {
  LoraBME280 *bme = &cache.data.remotes[ nodedIdx].bme;
  const char* name = node_names[ nodedIdx];
  uint8_t decimal = bme->temp % 10;

  //display.drawRect( x, y, 60, 46, DEFAULT_TEXT_COLOR);
  //display.fillRect( x, y, 60, 46, DEFAULT_TEXT_COLOR);
  //display.setTextColor( WHITE);

  display.setFont( NULL); //DEFAULT_BOLD);
  sprintAt( x+2, y+3, name);

  //display.setFont( NULL);
  if ( bme) {
    display.setFont( DEFAULT_BOLD);
    sprintAt( x+8, y+12, "% 4.0f", (float)bme->temp / 10);
    sprintAt( x+8, y+27, "% 4.0f", (float)bme->hmd / 10);
    sprintAt( x+8, y+42, "% 4.0f", (float)bme->prs / 10);

    display.setFont( NULL);
    sprintAt( x+53, y+2, "%i", decimal);
    sprintAt( x+53, y+17, "%%");
    sprintAt( x+53, y+30, "m");
    sprintAt( x+53, y+36, "m");
  }
  //drawHBar( 72, y+1, 50, 5, batLevel);
  //display.setTextColor( BLACK);
}

void drawHist( uint8_t x, uint8_t y, uint8_t nodedIdx) {
  int8_t i, idx, start;
  uint16_t minP=12000, maxP=100, mid;
  float scale,yp;
  climHist *hist = &cache.data.remotes[ nodedIdx].hist;
  const char* name = node_names[ nodedIdx];

  //display.drawRect( x, y, 122, 52, DEFAULT_TEXT_COLOR);

  display.setFont( NULL); //DEFAULT_FONT);
  sprintAt( x+2, y+2, name);

  Serial.printf("hist % 3i - % 3i\n", hist->current, hist->last);

  if ( hist->current >= 0) {
    idx = hist->last;
    for( i=0; i<HIST_DEPTH; i++) {
      if ( hist->bme[idx].prs > maxP) maxP = hist->bme[idx].prs;
      if ( hist->bme[idx].prs < minP) minP = hist->bme[idx].prs;

      if ( i % 2) display.drawPixel( i+1, y+51-hist->bme[idx].hmd/20, DEFAULT_TEXT_COLOR);

      if ( idx == hist->current)
        break;

      idx = (idx+1) % HIST_DEPTH;
    }

    idx = hist->last;
    scale = (maxP == minP) ? 1 : (50.0 / (float)(maxP - minP));
    scale = min( (float) 1.0, scale);
    mid = (maxP == minP) ? minP : (maxP + minP) / 2;

    Serial.printf("PRS %f / %i / %i\n[", scale, minP, maxP);
    for( i=0; i<HIST_DEPTH; i++) {
      yp = (float)(hist->bme[idx].prs-mid)*scale;
      display.drawPixel( i+1, y+25-yp, DEFAULT_TEXT_COLOR);

      Serial.printf("%i ", (int16_t) yp);
      if ( i%12 == 11) Serial.println();

      if ( idx == hist->current)
        break;

      idx = (idx+1) % HIST_DEPTH;
    }
    Serial.println("]");
  }
}

void drawNode( uint8_t x, uint8_t y, LoraNode *node, const char* name) {
  uint8_t batLevel = 0;
  char status = '.';

  display.setFont( NULL);
  if ( node) {
    if ( node->vbat > 0) {
      batLevel = min( 50, (node->vbat -325) /2);
      sprintAt( 40, y, "%.2fv", (float)node->vbat / 100);
    } else {
        sprintAt( 40, y, "-.--v" );
    }
    switch( node->meta & STS_MMASK) {
      case STS_EMERG: status = '*'; break;
      case STS_ALERT: status = '+'; break;
      case STS_RELAX: status = '-'; break;
    }
    sprintAt( 30, y, "%c", status);
  }
  drawHBar( 72, y+1, 50, 5, batLevel);
  sprintAt( 0, y, name);
}

void drawFcntBar( uint8_t y, uint8_t h, uint32_t fCntUp) {
  uint32_t mask = 0x01;
  uint32_t bitX = 0;
  for( uint8_t i = 0; i < 32; i++) {
    if (fCntUp & mask) display.fillRect( bitX, y, 4, h, DEFAULT_TEXT_COLOR);
    bitX += 4;
    mask <<= 1;
  }
  if (fCntUp & 0x40000000) display.fillRect( 120, y, 1, h, DEFAULT_TEXT_COLOR);
  if (fCntUp & 0x80000000) display.fillRect( 121, h, 1, h, DEFAULT_TEXT_COLOR);
}
//-------------------------------------------------------

void heltec_ve(bool state) {
  if (state) Platform::VExtOn();
  else Platform::VExtOff();
}

void heltec_led(int percent) {
  if (percent) {
    // enable LED
    pinMode(LED_BUILTIN, OUTPUT);
    digitalWrite(LED_BUILTIN, HIGH);
  } else {
    // disable LED
    digitalWrite(LED_BUILTIN, LOW);
  }
}

void heltec_deep_sleep(int seconds = 0) {
  
  //radio.sleep();
  Platform::prepareToSleep();

  if (seconds) {
      esp_sleep_enable_timer_wakeup((uint64_t) 1000 * 1000 * seconds);  // Microseconds
  }

  // Sleep now
  esp_deep_sleep_start();
}

float heltec_temperature() {
  float result = 0;

  // If temperature for given n below this value,
  // then this is the best measurement we have.
  int cutoffs[5] = { -30, -10, 80, 100, 2500 };
  
  #if ESP_ARDUINO_VERSION_MAJOR >= 3

    int range_start[] = { -40, -30, -10,  20,  50 };
    int range_end[]   = {  20,  50,  80, 100, 125 };
    temperature_sensor_handle_t temp_handle = NULL;
    for (int n = 0; n < 5; n++) {
      temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(range_start[n], range_end[n]);
      ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_handle));
      ESP_ERROR_CHECK(temperature_sensor_enable(temp_handle));
      ESP_ERROR_CHECK(temperature_sensor_get_celsius(temp_handle, &result));
      ESP_ERROR_CHECK(temperature_sensor_disable(temp_handle));
      ESP_ERROR_CHECK(temperature_sensor_uninstall(temp_handle));
      if (result <= cutoffs[n]) break;
    }

  #else

    // We start with the coldest range, because those temps get spoiled 
    // the quickest by heat of processor waking up. 
    temp_sensor_dac_offset_t offsets[5] = {
      TSENS_DAC_L4,   // (-40°C ~  20°C, err <3°C)
      TSENS_DAC_L3,   // (-30°C ~  50°C, err <2°C)
      TSENS_DAC_L2,   // (-10°C ~  80°C, err <1°C)
      TSENS_DAC_L1,   // ( 20°C ~ 100°C, err <2°C)
      TSENS_DAC_L0    // ( 50°C ~ 125°C, err <3°C)
    };
    for (int n = 0; n < 5; n++) {
      temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
      temp_sensor.dac_offset = offsets[n];
      temp_sensor_set_config(temp_sensor);
      temp_sensor_start();
      temp_sensor_read_celsius(&result);
      temp_sensor_stop();
      if (result <= cutoffs[n]) break;
    }

  #endif

  return result;
}

float heltec_vbat() {
  pinMode(VBAT_CTRL, OUTPUT);
  digitalWrite(VBAT_CTRL, HIGH);
  delay(5);
  float vbat = analogRead(VBAT_ADC) / 537.7;
  // pulled up, no need to drive it
  pinMode(VBAT_CTRL, INPUT);

  return vbat;
}

const float min_voltage = 3.04;
const float max_voltage = 4.26;
const uint8_t scaled_voltage[100] = {
  254, 242, 230, 227, 223, 219, 215, 213, 210, 207,
  206, 202, 202, 200, 200, 199, 198, 198, 196, 196,
  195, 195, 194, 192, 191, 188, 187, 185, 185, 185,
  183, 182, 180, 179, 178, 175, 175, 174, 172, 171,
  170, 169, 168, 166, 166, 165, 165, 164, 161, 161,
  159, 158, 158, 157, 156, 155, 151, 148, 147, 145,
  143, 142, 140, 140, 136, 132, 130, 130, 129, 126,
  125, 124, 121, 120, 118, 116, 115, 114, 112, 112,
  110, 110, 108, 106, 106, 104, 102, 101, 99, 97,
  94, 90, 81, 80, 76, 73, 66, 52, 32, 7,
};

int heltec_battery_percent(float vbat = -1) {
  if (vbat == -1) {
    vbat = heltec_vbat();
  }
  for (int n = 0; n < sizeof(scaled_voltage); n++) {
    float step = (max_voltage - min_voltage) / 256;
    if (vbat > min_voltage + (step * scaled_voltage[n])) {
      return 100 - n;
    }
  }
  return 0;
}

void heltec_display_power(bool on) {
  heltec_ve( on);
}

void heltec_setup() {
  Serial.begin(115200);

