mschorer/chirp_esp32_node_proto_epaper/chirp_esp32_node_proto_epaper.ino
  heltec_display_power(true);

  //display.landscape();
  display.setTextWrap(false); 
  display.setTextColor(DEFAULT_TEXT_COLOR);
  display.setFont( NULL); //DEFAULT_FONT);
  display.setTextSize(0);

  //display.drawRect( 200, 1, 48, 120, DEFAULT_TEXT_COLOR);

  // no longer needed as fixed in lib
  // gpio_hold_dis((gpio_num_t) PIN_LORA_NSS);
}

void heltec_loop() {
}

//-------------------------------------------------------

//---- Code ----

void setup() {
  byte i;

  //--
  restoreData( &cache);

  //---- start ----
  heltec_setup();
  heltec_led(LED_LOW);

  //--  
  localNode = (LoraNode *) up.addSensor( SensorData::SensorType::NODE, sizeof( LoraNode));

  // Obtain directly after deep sleep
  // May or may not reflect room temperature, sort of. 
  float temp = heltec_temperature();
  //Serial.printf("Temperature: %.1f C\n", temp);

  analogReadResolution(12);
  
  pinMode(VBAT_CTRL, OUTPUT);
  digitalWrite(VBAT_CTRL, LOW);
  delay(5);
  int vint = analogRead(VBAT_ADC);
  float vbat = vint * ADC_SCALE;
  // pulled up, no need to drive it
  pinMode(VBAT_CTRL, INPUT);

  //Serial.printf( "Bat: %i\n", vint);
  int vperc = heltec_battery_percent(vbat);
  //Serial.printf("%i%%\n", vperc);

  // 0 = external power source
  // 1 = lowest (empty battery)
  // 254 = highest (full battery)
  // 255 = unable to measure
  uint8_t battLevel = 0;
  battLevel = int((float)vperc * 2.54);

  Serial.printf("%.1fC / %.2fV / %3i%% / %i\n", temp, vbat, vperc, battLevel);

  //sprintAt( 0, 0, "Node\n%.1fC %.2fV %3i%%", temp, vbat, vperc);
  // prepare data -----------------------------

  localNode->cputemp = temp * 10;
  localNode->vbat = vbat * 100;

  Serial.printf( "esp temp/vbat[ %i %i ]\n", localNode->cputemp, localNode->vbat);

  //---- run ----

  //display.display();
  //display.update();

  persistData( &cache);

  // send (and receive data) ------------------------------------

  // initialize radio
  Serial.print("init ... ");

  radio.reset();
  int16_t state = radio.begin();
  uint32_t fCntUp = 0;

  if (state == RADIOLIB_ERR_NONE) {

    node = persist.manage(&radio);

    if ( node->isActivated()) {

      Serial.println( "session restored!");
      
      Serial.print("[LoRaWAN] DevAddr: ");
      Serial.println((unsigned long)node->getDevAddr(), HEX);

      Serial.printf( "rssi %.1f snr %.1f frq %.1f\n", radio.getRSSI(), radio.getSNR(), radio.getFrequencyError());
      //heltec_led(LED_MID);

      // If we're still here, it means we joined, and we can send something

      // Enable the ADR algorithm (on by default which is preferable)
      node->setADR(true);
      // Set a datarate to start off with
      node->setDatarate(5);
      // Manages uplink intervals to the TTN Fair Use Policy
      node->setDutyCycle(true, LORA_DUTY_CYCLE);   // zero sets max val by law, TTN 30s/24h: [1250]ms/1h);
      // Update dwell time limits - 400ms is the limit for the US
      node->setDwellTime(true, 400);  // zero sets max val by law, 400);

      node->setDeviceStatus(battLevel);

      //-----------------------------------------------------------------
      
      heltec_led(LED_OFF);
      Serial.print( "Sending ... ");

      // Retrieve the last uplink frame counter
      fCntUp = node->getFCntUp();
      Serial.println( "FCNTUP "+String( fCntUp));

      size_t downlinkSize = DOWN_SIZE;
      if(fCntUp == 1) {
        Serial.println(F("and requesting LinkCheck and DeviceTime"));
        node->sendMacCommandReq(RADIOLIB_LORAWAN_MAC_LINK_CHECK);
        node->sendMacCommandReq(RADIOLIB_LORAWAN_MAC_DEVICE_TIME);

        state = node->sendReceive( up.buffer, up.eod, fPort, down.buffer, &downlinkSize, true, &uplinkDetails, &downlinkDetails);
      } else {
        state = node->sendReceive( up.buffer, up.eod, fPort, down.buffer, &downlinkSize, false, &uplinkDetails, &downlinkDetails);
      }
      down.eod = (uint8_t) downlinkSize;

      if(state == RADIOLIB_ERR_NONE) {
        Serial.println("OK.");
        //heltec_led(LED_BRIGHT);
      } else if (state > 0) {
      // Check if a downlink was received 
      // (state 0 = no downlink, state 1/2 = downlink in window Rx1/Rx2)
        Serial.printf("OK. Downlink data! [%i] #%i\n", state, down.eod);

        // Did we get a downlink with data for us
        if ( down.eod > 0) {
          Serial.println(F("Downlink data: "));
          arrayDump( down.buffer, down.eod);

          handleDownlink( &down);

          persistData( &cache);
        } else {
          Serial.println(F("<MAC commands only>"));
        }

        //dumpDownlinkStats( state);

        //heltec_led(LED_BRIGHT);
      } else {
        Serial.printf("Error %d\n", state);
        //heltec_led(LED_LOW);
      }
    } else {
      Serial.println("RESTORE FAILED!");
    }
  } else {
      Serial.printf("error [%x] - postpone.\n", state);
      Serial.println(stateDecode( state));
  }

  //-------
  heltec_led(LED_LOW);

  display.drawLine( 0, 99, 122, 99, DEFAULT_TEXT_COLOR);
  display.drawLine( 62, 99, 62, 144, DEFAULT_TEXT_COLOR);
  display.drawLine( 0, 145, 122, 145, DEFAULT_TEXT_COLOR);

  display.drawLine( 0, 45, 122, 45, DEFAULT_TEXT_COLOR);
  display.drawLine( 0, 96, 122, 96, DEFAULT_TEXT_COLOR);

  drawNode( 0, 0, localNode, "DISP");
  uint8_t y = 9;
  for( uint8_t i = 0; i < REMOTE_NODES; i++) {
    drawNode( 0, y, &cache.data.remotes[ i].node, node_names[ i]);
    y += 9;
  }
  
  drawHist( 0, 45, NODE_WELL);

  drawFcntBar( 97, 3, fCntUp);

  drawBME( 0, 100, NODE_WELL);
  drawBME( 62, 100, NODE_CAMP);

  drawFill( 150);

  heltec_led(LED_OFF);

  //display.display();
  display.update();

  goToSleep();    // Does not return, program starts over next round
}

void handleDownlink( SensorData *down) {
  uint8_t index = 0;
  uint8_t i = 0;
  uint8_t rmt, newMeta;;
  LoraToF* tof = 0;
  LoraFill* fill = 0;
  LoraNode* node = 0;
  LoraBME280 *bme = 0;
  LoraSensor* remoteStatus = 0;
  LoraDS18B20* onewire = 0;

  Serial.printf( "Downlink  [%i]:\n", down->eod);

  while( index < down->eod) {
    switch( down->buffer[ index]) {
      case SensorData::SensorType::STATUS:
          remoteStatus = (LoraSensor *) &down->buffer[index];
          index += sizeof( LoraSensor);

