mschorer/chirp_esp32_node_proto_epaper/chirp_esp32_node_proto_epaper.ino
          localNode->meta = remoteStatus->meta;
          Serial.printf( "status [%i]\n", localNode->meta);
      break;

      case SensorData::SensorType::ID:
        index += sizeof( LoraID);
        Serial.println( "ID");
      break;

      case SensorData::SensorType::NODE:
        node = (LoraNode *) &down->buffer[index];
        index += sizeof( LoraNode);
        rmt = (node->meta & REMOTE_NODE_MASK);

        Serial.printf( "Node %i: %.2fV %.1fC\n", rmt, (float) node->vbat /100, (float)node->cputemp /10);
        //sprintAt( 0, rmt*50, "remote %i\n%.2fV %.1fC\n", rmt, (float) node->vbat /100, (float)node->cputemp /10);

        memcpy( &cache.data.remotes[ rmt].node, node, sizeof( LoraNode));
      break;

      case SensorData::SensorType::DS18B20:
        onewire = (LoraDS18B20 *) &down->buffer[index];
        index += sizeof( LoraDS18B20);
        rmt = (onewire->meta & 0x1f);
        Serial.printf( "1wire%i\n", rmt);
      break;

      case SensorData::SensorType::BME280:
        bme = (LoraBME280 *) &down->buffer[index];
        index += sizeof( LoraBME280);
        rmt = (bme->meta & REMOTE_NODE_MASK);

        memcpy( &cache.data.remotes[ rmt].bme, bme, sizeof( LoraBME280));

        if ( cache.data.remotes[ rmt].hist.current < 0) {
          cache.data.remotes[ rmt].hist.current = 0;
        } else {
          cache.data.remotes[ rmt].hist.current = (cache.data.remotes[ rmt].hist.current+1) % HIST_DEPTH;
          if ( cache.data.remotes[ rmt].hist.current == cache.data.remotes[ rmt].hist.last)
            cache.data.remotes[ rmt].hist.last = (cache.data.remotes[ rmt].hist.last+1) % HIST_DEPTH;
        }

        memcpy( &cache.data.remotes[ rmt].hist.bme[ cache.data.remotes[ rmt].hist.current], bme, sizeof( LoraBME280));
        //cache.data.remotes[ rmt].tof.dist = 550;

        Serial.printf( "BME  %i: %i C\n", rmt, bme->temp);
        Serial.printf( "      : %i h\n", bme->hmd);
        Serial.printf( "      : %i p\n", bme->prs);
        i++;
      break;
      
      case SensorData::SensorType::TOF:
        tof = (LoraToF *) &down->buffer[index];
        index += sizeof( LoraToF);
        rmt = (tof->meta & REMOTE_NODE_MASK);

        memcpy( &cache.data.remotes[ rmt].tof, tof, sizeof( LoraToF));
        //cache.data.remotes[ rmt].tof.dist = 550;

        Serial.printf( "ToF  %i: %imm\n", rmt, tof->dist);
        //Serial.printf( "     %i: %imm\n", 0, cache.data.remotes[ NODE_CAMP].tof.dist);
        //Serial.printf( "     %i: %imm\n", 1, cache.data.remotes[ NODE_WELL].tof.dist);
        //Serial.println( "TOF parsed");
        //Serial.println( tof->dist);
        i++;
      break;

      case SensorData::SensorType::GPS:
        index += sizeof( LoraGps);
        Serial.println( "  gps");
      break;

      case SensorData::SensorType::FILL:
        fill = (LoraFill *) &down->buffer[index];
        index += sizeof( LoraFill);
        rmt = (fill->meta & REMOTE_NODE_MASK);

        memcpy( &cache.data.remotes[ rmt].fill, fill, sizeof( LoraFill));

        Serial.printf( "Fill %i: %i%%\n", rmt, fill->percent/100);
        //Serial.printf( "     %i: %i%%\n", 0, cache.data.remotes[ NODE_CAMP].fill.percent);
        //Serial.printf( "     %i: %i%%\n", 1, cache.data.remotes[ NODE_WELL].fill.percent);
        //Serial.println( "TOF parsed");
        //Serial.println( tof->dist);
        i++;
      break;

      default:
        Serial.printf( "xTra data. @%i [%02x] [%c]\n", index, down->buffer[ index], down->buffer[ index]);
        index = down->eod;
    }
  }
}

//-------------------------------------------------------------------

void loop() {
  heltec_loop();
}

//-------------------------------------------------------------------

void goToSleep() {
  uint32_t interval = 0;
  char* mState[] = { "DCARE", "RELAX", "ALERT", "EMERG"};

  // -------------------

  uint8_t meta = localNode->meta & STS_MMASK;
  switch( meta) {
    case STS_EMERG:
      cache.data.loraDelay = EMERG_DELAY;
      cache.data.loraDlyFb = EMERG_FB;
    break;

    case STS_ALERT:
      cache.data.loraDelay = ALERT_DELAY;
      cache.data.loraDlyFb = ALERT_FB;
    break;

    case STS_RELAX:
      cache.data.loraDelay = RELAX_DELAY;
      cache.data.loraDlyFb = RELAX_FB;
    break;

    case STS_DCARE:
    default:
      cache.data.loraDelay = MINIMUM_DELAY;
      cache.data.loraDlyFb = 0;
  }

  if ( cache.data.loraDlyFb > 0) {
    cache.data.loraDlyFb--;
  } else {
    cache.data.loraDelay = MINIMUM_DELAY;
  }

  // allows recall of the session after deepsleep
  if ( node) {
    persist.saveSession(node);

    // Calculate minimum duty cycle delay (per FUP & law!)
    interval = node->timeUntilUplink();
  }

  // And then pick it or our MINIMUM_DELAY, whichever is greater
  uint32_t delayMs = max(interval, (uint32_t) cache.data.loraDelay * 1000);

  Serial.printf("DeepSleep for [%s] [%d]-[%dk @%d]\n", mState[ STS_MSHIFT(meta)], interval, cache.data.loraDelay, cache.data.loraDlyFb);
  Serial.println( "----");

  delayMs = blinkMode( meta, delayMs);

  // and off to bed we go
  heltec_deep_sleep(delayMs/1000);
}

uint32_t blinkMode( uint8_t meta, uint32_t delayMs) {
  uint8_t loops = 0;
  //Serial.printf( "metamode [%02x]\n", meta);

  while( loops < 64) {
    //Serial.printf("(%d)", loops);

    switch( loops % 8) {
      case 6:
        if ( meta <= STS_EMERG) break;
      case 4:
        if ( meta <= STS_ALERT) break;
      case 2:
        if ( meta <= STS_RELAX) break;
      case 0:
        //Serial.printf( "[%i]", loops);
        heltec_led( LED_LOW);
        break;

      default:
        heltec_led(LED_OFF);
        //Serial.printf( "#%i#", loops);
    }

    loops++;
    delayMs -= 100;
    delay( 100);
  }

  return delayMs;
}

// result code to text - these are error codes that can be raised when using LoRaWAN
// however, RadioLib has many more - see https://jgromes.github.io/RadioLib/group__status__codes.html for a complete list
String stateDecode(const int16_t result) {
  switch (result) {
  case RADIOLIB_ERR_NONE:
    return "ERR_NONE";
  case RADIOLIB_ERR_CHIP_NOT_FOUND:
    return "ERR_CHIP_NOT_FOUND";
  case RADIOLIB_ERR_PACKET_TOO_LONG:
    return "ERR_PACKET_TOO_LONG";
  case RADIOLIB_ERR_RX_TIMEOUT:
    return "ERR_RX_TIMEOUT";
  case RADIOLIB_ERR_CRC_MISMATCH:
    return "ERR_CRC_MISMATCH";
  case RADIOLIB_ERR_INVALID_BANDWIDTH:
    return "ERR_INVALID_BANDWIDTH";
  case RADIOLIB_ERR_INVALID_SPREADING_FACTOR:
    return "ERR_INVALID_SPREADING_FACTOR";
  case RADIOLIB_ERR_INVALID_CODING_RATE:
    return "ERR_INVALID_CODING_RATE";
  case RADIOLIB_ERR_INVALID_FREQUENCY:
    return "ERR_INVALID_FREQUENCY";
  case RADIOLIB_ERR_INVALID_OUTPUT_POWER:
    return "ERR_INVALID_OUTPUT_POWER";
  case RADIOLIB_ERR_NETWORK_NOT_JOINED:
	  return "RADIOLIB_ERR_NETWORK_NOT_JOINED";
  case RADIOLIB_ERR_DOWNLINK_MALFORMED:
    return "RADIOLIB_ERR_DOWNLINK_MALFORMED";
  case RADIOLIB_ERR_INVALID_REVISION:
    return "RADIOLIB_ERR_INVALID_REVISION";
  case RADIOLIB_ERR_INVALID_PORT:
    return "RADIOLIB_ERR_INVALID_PORT";
  case RADIOLIB_ERR_NO_RX_WINDOW:
    return "RADIOLIB_ERR_NO_RX_WINDOW";
  case RADIOLIB_ERR_INVALID_CID:
    return "RADIOLIB_ERR_INVALID_CID";
  case RADIOLIB_ERR_UPLINK_UNAVAILABLE:
    return "RADIOLIB_ERR_UPLINK_UNAVAILABLE";
  case RADIOLIB_ERR_COMMAND_QUEUE_FULL:
    return "RADIOLIB_ERR_COMMAND_QUEUE_FULL";
  case RADIOLIB_ERR_COMMAND_QUEUE_ITEM_NOT_FOUND:
    return "RADIOLIB_ERR_COMMAND_QUEUE_ITEM_NOT_FOUND";
  case RADIOLIB_ERR_JOIN_NONCE_INVALID:
    return "RADIOLIB_ERR_JOIN_NONCE_INVALID";
  /*
  case RADIOLIB_ERR_MIC_MISMATCH:
    return "RADIOLIB_ERR_MIC_MISMATCH";
  case RADIOLIB_ERR_MULTICAST_FCNT_INVALID:
    return "RADIOLIB_ERR_MULTICAST_FCNT_INVALID";
  */
  case RADIOLIB_ERR_DWELL_TIME_EXCEEDED:
    return "RADIOLIB_ERR_DWELL_TIME_EXCEEDED";
  case RADIOLIB_ERR_CHECKSUM_MISMATCH:
    return "RADIOLIB_ERR_CHECKSUM_MISMATCH";
  case RADIOLIB_ERR_NO_JOIN_ACCEPT:
    return "RADIOLIB_ERR_NO_JOIN_ACCEPT";
  case RADIOLIB_LORAWAN_SESSION_RESTORED:
    return "RADIOLIB_LORAWAN_SESSION_RESTORED";
  case RADIOLIB_LORAWAN_NEW_SESSION:
    return "RADIOLIB_LORAWAN_NEW_SESSION";
  case RADIOLIB_ERR_NONCES_DISCARDED:
    return "RADIOLIB_ERR_NONCES_DISCARDED";
  case RADIOLIB_ERR_SESSION_DISCARDED:
    return "RADIOLIB_ERR_SESSION_DISCARDED";

  default:
    Serial.printf( "ERR: [%i]\n", result);
    return "---";
  }
  return "See https://jgromes.github.io/RadioLib/group__status__codes.html";
}

void dumpDownlinkStats(const int16_t state) {
  // print RSSI (Received Signal Strength Indicator)
  Serial.print(F("[LoRaWAN] RSSI:\t\t"));
  Serial.print(radio.getRSSI());
  Serial.println(F(" dBm"));

  // print SNR (Signal-to-Noise Ratio)
  Serial.print(F("[LoRaWAN] SNR:\t\t"));
  Serial.print(radio.getSNR());
  Serial.println(F(" dB"));

  // print extra information about the event
  Serial.println(F("[LoRaWAN] Event information:"));
  Serial.print(F("[LoRaWAN] Confirmed:\t"));
  Serial.println(downlinkDetails.confirmed);
  Serial.print(F("[LoRaWAN] Confirming:\t"));
  Serial.println(downlinkDetails.confirming);
  Serial.print(F("[LoRaWAN] Datarate:\t"));
  Serial.println(downlinkDetails.datarate);
  Serial.print(F("[LoRaWAN] Frequency:\t"));
  Serial.print(downlinkDetails.freq, 3);
  Serial.println(F(" MHz"));
  Serial.print(F("[LoRaWAN] Frame count:\t"));
  Serial.println(downlinkDetails.fCnt);
  Serial.print(F("[LoRaWAN] Port:\t\t"));
  Serial.println(downlinkDetails.fPort);
  Serial.print(F("[LoRaWAN] Time-on-air: \t"));
  Serial.print(node->getLastToA());
  Serial.println(F(" ms"));
  Serial.print(F("[LoRaWAN] Rx window: \t"));
  Serial.println(state);

