mschorer/chirp_esp32_node_proto_epaper/chirp_esp32_node_proto_epaper.ino
  uint8_t margin = 0;
  uint8_t gwCnt = 0;
  if(node->getMacLinkCheckAns(&margin, &gwCnt) == RADIOLIB_ERR_NONE) {
    Serial.print(F("[LoRaWAN] LinkCheck margin:\t"));
    Serial.println(margin);
    Serial.print(F("[LoRaWAN] LinkCheck count:\t"));
    Serial.println(gwCnt);
  }

  uint32_t networkTime = 0;
  uint16_t fracSecond = 0;
  if(node->getMacDeviceTimeAns(&networkTime, &fracSecond, true) == RADIOLIB_ERR_NONE) {
    Serial.print(F("[LoRaWAN] DeviceTime Unix:\t"));
    Serial.println(networkTime);
    Serial.print(F("[LoRaWAN] DeviceTime second:\t1/"));
    Serial.println(fracSecond);
  }
}
// helper function to display any issues
void debug(bool failed, const __FlashStringHelper* message, int state, bool halt) {
  if(failed) {
    Serial.print(message);
    Serial.print(" - ");
    Serial.print(stateDecode(state));
    Serial.print(" (");
    Serial.print(state);
    Serial.println(")");
    while(halt) { delay(1); }
  }
}

// helper function to display a byte array
void arrayDump(uint8_t *buffer, uint16_t len) {
  for(uint16_t c = 0; c < len; c++) {
    char b = buffer[c];
    if(b < 0x10) { Serial.print('0'); }
    Serial.print(b, HEX);
    Serial.print(' ');

    if ( c % 8 == 7) Serial.println();
  }
  Serial.println();
}

byte crcCheck( byte* buf, byte maxIdx) {
  byte crc = OneWire::crc8( buf, maxIdx);
  if ( crc != buf[maxIdx]) {
#ifdef CRC_DEBUG
    Serial.print("CRC err ");
    Serial.print( maxIdx, DEC);
    Serial.print(" ");
    Serial.print( crc, HEX);
    Serial.print( " != ");
    Serial.println( buf[maxIdx], HEX);
#endif
    return TRUE;
  }

  return FALSE;
}

uint32_t calculateCRC32(const uint8_t *data, size_t len) {
#ifdef CRC_DEBUG
  Serial.print( "crc32 @");
  Serial.print( (uint32_t) data);
  Serial.print( " #");
  Serial.print( len);
#endif
  uint32_t crc = 0xffffffff;
  while (len--) {
    uint8_t c = *data++;
    for (uint32_t i = 0x80; i > 0; i >>= 1) {
      bool bit = crc & 0x80000000;
      if (c & i) {
        bit = !bit;
      }
      crc <<= 1;
      if (bit) {
        crc ^= 0x04c11db7;
      }
    }
  }
#ifdef CRC_DEBUG
  Serial.print( " = ");
  Serial.print( crc,  16);
  Serial.println("");
#endif

  return crc;
}